[{"tittle":"REWA Portal, Ladakh","details":"Rewa portal provides a platform to the esteemed students to apply for the financial assistance with ease. The scholarship portal has a review process to ensure that only eligible students receive scholarships.","more":"https://socialwelfare.ladakh.gov.in/rewa/"},{"tittle":"Application form for OBC non-creamy layer certificate in Assam","details":"You can get the application form for obtaining the OBC Non-Creamy Layer Certificate in Assam. Users must read the form carefully and fill up as per the given instructions. The form is provided by the Department of Information Technology of the State Government.","more":"https://cachar.gov.in/how-to-categories/non-creamy-layer-certificate"},{"tittle":"Scheme to provide Post Matric Scholarship for Minorities in Tripura","details":"Users can get detailed information on the Post Matric Scholarship for Minorities in Tripura.","more":"https://bms.tripura.gov.in/bmscitizenportal/viewDetails.jsp?data=990"},{"tittle":"Scheme for DR. B. R. Ambedkar Merit Award, Welfare of Scheduled Castes in Tripura","details":"Get information about the DR. B. R. Ambedkar Merit Award in Tripura.","more":"https://bms.tripura.gov.in/bmscitizenportal/viewDetails.jsp?data=949"},{"tittle":"Scheme for DR. B. R. Ambedkar Merit Award in Tripura","details":"Get information about the DR. B. R. Ambedkar Merit Award in Tripura. Applicant belongs to OBC community. Secured at least 60% marks in Madhyamik or H.S. (+2) from any School in Tripura.","more":"https://bms.tripura.gov.in/bmscitizenportal/viewDetails.jsp?data=1002"},{"tittle":"Central sector scheme of free coaching for SC and OBC students","details":"A combined Scheme, namely Coaching and Allied Assistance for Weaker Sections including scheduled castes, Other Backward Classes and minorities was introduced with effect from September, 2001. This Centrally sponsored scheme has been revamped and renamed as the Central Sector Scheme of Free Coaching for SC and OBC Students (Effective from April, 2007). Users can get detailed information on the... ","more":"https://socialjustice.gov.in/schemes/30"},{"tittle":"Organizations under Welfare of Backward Classes division","details":"Get information about organizations under Welfare of Backward Classes division of Ministry of Social Justice and Empowerment. Users can get details about National Commission for Backward Classes (NCBC) and National Backward Classes Finance and Development Corporation (NBCFDC). Information on the National Commission for Backward Classes Act which was enacted for setting up a National Commission... ","more":"https://socialjustice.gov.in/common/31548"},{"tittle":"Website of Ministry of Social Justice and Empowerment","details":"Detailed information about the Ministry of Social Justice and Empowerment and its various social welfare activities is given. Users can find information pertaining to schemes for schedule castes, scheduled tribes, persons with disabilities, senior citizens and victim of substance abuse etc. Details of Constitutional provisions and Acts, Rules etc. are also given. Information about grant-in-aid... ","more":"https://socialjustice.gov.in/"},{"tittle":"Format for list of beneficiaries of schemes for Other Backward Classes","details":"Get format for list of beneficiaries of schemes for Other Backward Classes (OBC) by the Ministry of Social Justice and Empowerment is given. This form is meant for voluntary organisations working for OBCs. Users can download the form and use it further.","more":"https://socialjustice.gov.in/writereaddata/UploadFile/obcgiabene.pdf"},{"tittle":"Central list of Other Backward Classes by Ministry of Social Justice and Empowerment ","details":"Find state-wise Central list of Other Backward Classes (OBCs) provided by the Ministry of Social Justice and Empowerment. User can get the list of the castes, sub-castes and communities in the respective states. Resolution number and date of each caste are available.","more":"http://www.ncbc.nic.in/user_panel/centralliststateview.aspx"},{"tittle":"Application cum Monitoring Form for 1st Installment of Grant-In-Aid to Voluntary Organisations working for Other Backward Classes","details":"Find the Application cum Monitoring Form for Grant-In-Aid to Voluntary Organisations working for Other Backward Classes (For 1st Installment and New Cases) (Training Programme) provided by the Ministry of Social Justice and Empowerment. Users can download the form and use it further.","more":"https://socialjustice.gov.in/writereaddata/UploadFile/obcgia1.pdf"},{"tittle":"Proforma for Inspection of Voluntary Organisation receiving grant in aid for the welfare of Other Backward Classes","details":"Get Proforma for Inspection of Voluntary Organisation receiving grant in aid for the welfare of Other Backward Classes (OBC) provided by the Ministry of Social Justice and Empowerment. This form is meant for voluntary organisations for the welfare of OBC. Users can download the form and use it further. Instructions on how to fill the form are also available.","more":"https://socialjustice.gov.in/writereaddata/UploadFile/obcgiainsp.pdf"},{"tittle":"Format for details of staff employed by Voluntary Organisations for Other Backward Classes","details":"Access to the format for details of staff employed by voluntary organisations for Other Backward Classes (OBCs) provided by the Ministry of Social Justice and Empowerment is given. Users can provide information about the staff such as name, address, designation, educational qualification, date of appointment, etc.","more":"https://socialjustice.gov.in/writereaddata/UploadFile/obcstaff.pdf"},{"tittle":"Format for details of Office-bearers or Managing Committee of the Organization","details":"Find the format for details of Office-bearers or Managing Committee of the organization provided by the Ministry of Social Justice and Empowerment. Users can provide information about name, occupation, address, educational qualification, post held, etc.","more":"https://socialjustice.gov.in/writereaddata/UploadFile/obcmancom.pdf"},{"tittle":"Proforma for Incremental Income of Beneficiaries due to Programme or Scheme for Other Backward Classes","details":"Get Proforma for Incremental Income of Beneficiaries due to Programme or Scheme during the last three years preceding provided by the Ministry of Social Justice and Empowerment. Users need to provide information such number of applicants, beneficiaries, number of employed, number of self-employed, etc. Users can download the form and use it further.","more":"https://socialjustice.gov.in/writereaddata/UploadFile/obcgia1.pdf"}]